InformationRegisters/__СостояниеСервераПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__СостояниеСервераПечати</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АвтоматическийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоВыполненныхЗаданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/__СостояниеЗаданийСервераПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__СостояниеЗаданийСервераПечати</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.__ВидыЗаданийСервераПечати</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Распечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТабличныйДокумент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмяПринтера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/__СерверПечатиСервер/Ext/Module.bsl
Функция НастройкаИмяПользователя(НРег = Истина) Экспорт
	
	// Имя пользователя сервера печати.
	Если НРег Тогда
		Возврат "server";
	КонецЕсли;
	
	Возврат "Server";

КонецФункции // РежимЗапускаПриложенияСерверПечати()


Функция РежимЗапускаПриложенияСерверПечати() Экспорт
	
	// Проверка.
	Если (НРег(ИмяПользователя()) = НастройкаИмяПользователя()) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции // РежимЗапускаПриложенияСерверПечати()


Процедура ПередНачаломРаботыСистемы(Отказ) Экспорт
	
	// Проврека.
	Отказ = Отказ Или (Не РегистрыСведений.__СостояниеСервераПечати.ПолучитьВозможностьЗапускаСервера());
			
КонецПроцедуры // ПередНачаломРаботыСистемы()

Процедура ПриНачалеРаботыСистемы(АвтоматическийРежим = Неопределено) Экспорт
	
	// Начало работы.
	РегистрыСведений.__СостояниеСервераПечати.УстановитьСостояниеНачалаРаботы(АвтоматическийРежим);

КонецПроцедуры // ПередНачаломРаботыСистемы()

Процедура ПриЗавершенииРаботыСистемы() Экспорт
	
	// Завершение работы.
	РегистрыСведений.__СостояниеСервераПечати.УстановитьСостояниеЗавершенияРаботы();

КонецПроцедуры // ПриЗавершенииРаботыСистемы()


Процедура ЗапускКлиентаСервера() Экспорт
	
	// Запуск сервера печати.
	Если Булево(НайтиФайлы(КаталогПрограммы() + "1cv8c.exe").Количество()) Тогда
		Параметры = "ENTERPRISE /IBConnectionString" + Char(034) + СтрЗаменить(СтрокаСоединенияИнформационнойБазы(), Char(034), Char(034) + Char(034)) + Char(034);
		Параметры = Параметры + Char(032) + "/N" + Char(034) + НастройкаИмяПользователя() + Char(034) + Char(032) + "/P" + Char(034) + РегистрыСведений.__НастройкиВебСервиса.ПолучитьПарольПользователяСервераПечати() + Char(034);
		Параметры = Параметры + " /WA- /AU- /DisableStartupMessages /Cauto";
		ЗапуститьПриложение(КаталогПрограммы() + "1cv8c.exe" + Char(032) + Параметры);
	КонецЕсли;
	
КонецПроцедуры  // ЗапускКлиентаСервера()

Процедура РегламентноеЗаданиеСервер() Экспорт
	
	// Сервер печати.
	Если (Не РегистрыСведений.__СостояниеСервераПечати.ПолучитьАктивностьСервера()) И
		 (Не РегистрыСведений.__СостояниеСервераПечати.ПолучитьПриостановленностьСервера()) Тогда
		ЗапускКлиентаСервера();
	КонецЕсли;

	// Веб-сервис.
	РегистрыСведений.__СостояниеСеансовВебСервиса.ОчиститьСеансы();
	
	// Сервер печати.
	РегистрыСведений.__СостояниеЗаданийСервераПечати.ОчиститьЗадания();
	
КонецПроцедуры  // СерверПечати()


Процедура Напечатать(ТабличныйДокумент, Вид = Неопределено) Экспорт 
	
	// Запись задания.
	РегистрыСведений.__СостояниеЗаданийСервераПечати.Напечатать(ТабличныйДокумент, Вид);
	
КонецПроцедуры // Напечатать()


Функция ПолучитьЗадания() Экспорт 
	
	// Результат.
	Возврат РегистрыСведений.__СостояниеЗаданийСервераПечати.ПолучитьЗадания();
	
КонецФункции // ПолучитьЗадания()
